{
  "format": "graph-model",
  "generatedBy": "2.20.0",
  "convertedBy": "TensorFlow.js Converter v4.15.0",
  "signature": {
    "inputs": {
      "input": {
        "name": "serving_default_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "17"
            }
          ]
        }
      }
    }
  },
  "outputs": {
    "output": {
      "name": "StatefulPartitionedCall:0",
      "dtype": "DT_FLOAT",
      "tensorShape": {
        "dim": [
          {
            "size": "-1"
          },
          {
            "size": "2"
          }
        ]
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "serving_default_input",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "17"
                }
              ]
            }
          }
        }
      },
      {
        "name": "dense/MatMul",
        "op": "MatMul",
        "input": [
          "serving_default_input",
          "dense/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "dense/MatMul",
          "dense/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense/Relu",
        "op": "Relu",
        "input": [
          "dense/BiasAdd"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_1/MatMul",
        "op": "MatMul",
        "input": [
          "dense/Relu",
          "dense_1/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_1/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "dense_1/MatMul",
          "dense_1/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_1/Relu",
        "op": "Relu",
        "input": [
          "dense_1/BiasAdd"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_2/MatMul",
        "op": "MatMul",
        "input": [
          "dense_1/Relu",
          "dense_2/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_2/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "dense_2/MatMul",
          "dense_2/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_2/Relu",
        "op": "Relu",
        "input": [
          "dense_2/BiasAdd"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_3/MatMul",
        "op": "MatMul",
        "input": [
          "dense_2/Relu",
          "dense_3/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_3/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "dense_3/MatMul",
          "dense_3/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "dense_3/Sigmoid",
        "op": "Sigmoid",
        "input": [
          "dense_3/BiasAdd"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      }
    ],
    "library": {},
    "versions": {
      "producer": 1482
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            17,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            64,
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            2
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}